modules/gateway/server/src/test/resources/com/l7tech/server/policy/resources/REQUEST_signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://warehouse.acme.com/ws">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-11DA83020116EB58C5152270595576940">MIICgjCCAWqgAwIBAgIJALLt3UmjdE/TMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjMxNjIxWhgPMjExODAzMDIyMzE2MjFaMEIxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAIUJPCtG7JthGRmQ8G1iryHRwCaU7aBRNqPl5dakkUsyoZLQ/ZBp7pOor6PnP/8l2FwF39bT8cR2lo2CqQqZ2UE7lCVq0Iz210U8Z1I7BcZw/ucEFhYE3NBsrXmI1eMTe9hwdvqvCmN48SWK1T4LaeYNN+P+QUSnkSEm8MvFQMiPAgMBAAGjDzANMAsGA1UdDwQEAwIEsDANBgkqhkiG9w0BAQUFAAOCAQEAFFJdESl83b5ChMRW6xfJJsfvG+Hdi55Ppgz98gKgoYMewX4dGAbaELLxeGH1iWvtuvUjxW4jEBkoV5iVtKDVwwJElt/mOFTnTguhdd/OJYDnNtVQd+URvk6QnG8tAvoKQxqsp6DSrs81W/pWVXMXe3xektcfq+NlGl1ylbmsj+oFd+XfiZbKKfE9YU4Q9oGs48T70a4uvIRhyaswZlO1vu+QNHHss40mwrhZV9s1QEOV8+l1EiyornIOQLVX/mQoBY+2wh5I5G7IzZp6oWA+L578D5KI84Yh4xXKR5+1r4P1+yCDNxIO6J+Iyizb5cEEcaS25Qw6GMUuVd/KKYqUWw==</wsse:BinarySecurityToken><ds:Signature Id="SIG-11DA83020116EB58C5152270595576944" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-11DA83020116EB58C5152270595576943"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>q3YeB/hEkq7bzyx2dti82OPLQSk=</ds:DigestValue></ds:Reference><ds:Reference URI="#TS-11DA83020116EB58C5152270595576739"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="wsse soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>e1SXfgzojVmg4Dhy1EB+Mb8UEsA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>YyI215C+83PyT72qXMxp+Zo30iBUZV4DWfRi1dcvw+SpvigInElfGuh7gL6i+tAEmcJ3oYmThZAR
no8bt62bYwE4c6P9amqgnDlvxKD7Hz805MCqYKhwO7ac0UxvrZ+uTiEqpN8b2D1xkiiKo8AxLEXT
8ZjgAS3EvK+3sU9Hm9M=</ds:SignatureValue><ds:KeyInfo Id="KI-11DA83020116EB58C5152270595576941"><wsse:SecurityTokenReference wsu:Id="STR-11DA83020116EB58C5152270595576942"><wsse:Reference URI="#X509-11DA83020116EB58C5152270595576940" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp wsu:Id="TS-11DA83020116EB58C5152270595576739"><wsu:Created>2018-04-02T21:52:35.767Z</wsu:Created><wsu:Expires>2018-04-02T21:57:35.767Z</wsu:Expires></wsu:Timestamp></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-11DA83020116EB58C5152270595576943" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ws:listProducts>
         <ws:delay>0</ws:delay>
      </ws:listProducts>
   </soapenv:Body>
</soapenv:Envelope>